name: "LICODS DB" 
layer {
  name: "color"
  type: "Python"
  top: "color"
  top: "depth"
  top: "label"
  python_param {
    module: "cityscapes_layers"
    layer: "CityscapesDataLayer"
    param_str: "{\'tops\': [\'color\', \'depth\', \'label\'], \'seed\':  1337, \'nyud_dir\': \'C:/Project/caffe/data/cityscapes_per8\',\'random\':\'randomize\', \'split\': \'val\',\'mean\': (72.37304537,82.88821633,73.14071475),\'mean_depth\':(60.98047365)}" #104.5433405   102.87902933  100.07886165 for camvid 72.37304537,82.88821633,73.14071475 for cityscapes 71.24554719  81.87040301  72.52604674 for augmented###cityscape augmented mean_depth\':(77.7066889)}  
  }
}
#### block 1
layer {
  name: "block1/rgb_pool"
  type: "Pooling"
  bottom: "color"
  top: "block1/rgb_pool"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "block1/conv_rgb_2x2"
  type: "Convolution"
  bottom: "color"
  top: "block1/conv_rgb_2x2"
  convolution_param {
    num_output: 14
    kernel_size: 2
    stride: 2
	pad: 0
	engine:CUDNN
  }
}
layer {
  name: "block1/elu_conv_rgb_2x2"
  type: "ELU"
  bottom: "block1/conv_rgb_2x2"
  top: "block1/conv_rgb_2x2" 
}
layer {
  name: "block1/conv_rgb_3x3"
  type: "Convolution"
  bottom: "color"
  top: "block1/conv_rgb_3x3"
  convolution_param {
    num_output: 14
    kernel_size: 3
    stride: 2
	pad: 1
	engine:CUDNN
  }
}
layer {
  name: "block1/elu_conv_rgb_3x3"
  type: "ELU"
  bottom: "block1/conv_rgb_3x3"
  top: "block1/conv_rgb_3x3" 
}
layer {
  name: "block1/d_pool"
  type: "Pooling"
  bottom: "depth"
  top: "block1/d_pool"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "block1/conv_d_2x2"
  type: "Convolution"
  bottom: "depth"
  top: "block1/conv_d_2x2"
   convolution_param {
    num_output: 8
    kernel_size: 2
    stride: 2
	pad: 0
	engine:CUDNN
  }
}
layer {
  name: "block1/elu_conv_d_2x2"
  type: "ELU"
  bottom: "block1/conv_d_2x2"
  top: "block1/conv_d_2x2" 
}
layer {
  name: "block1/conv_d_3x3"
  type: "Convolution"
  bottom: "depth"
  top: "block1/conv_d_3x3"
  convolution_param {
    num_output: 8
    kernel_size: 3
    stride: 2
	pad: 1
	engine:CUDNN
  }
}
layer {
  name: "block1/elu_conv_d_3x3"
  type: "ELU"
  bottom: "block1/conv_d_3x3"
  top: "block1/conv_d_3x3" 
}
layer {
  name: "block1/concat_rgb_1"
  type: "Concat"
  bottom : "block1/rgb_pool"
  bottom : "block1/conv_rgb_3x3"
  bottom : "block1/conv_rgb_2x2"
  top : "block1/concat_rgb_1"  
}
layer {
  name: "block1/concat_d_1"
  type: "Concat"
  bottom : "block1/d_pool"
  bottom : "block1/conv_d_3x3"
  bottom : "block1/conv_d_2x2"
  top : "block1/concat_d_1"  
}
##### end of block 1

###### block 2
layer {
  name: "fire2/squeeze1x1_rgb"
  type: "Convolution"
  bottom: "block1/concat_rgb_1"
  top: "fire2/squeeze1x1_rgb"
  convolution_param {
    num_output: 8
    kernel_size: 1
	engine:CUDNN
  }
}
layer {
  name: "fire2/elu_squeeze1x1_rgb"
  type: "ELU"
  bottom: "fire2/squeeze1x1_rgb"
  top: "fire2/squeeze1x1_rgb"
}
layer {
  name: "fire2/squeeze1x1_d"
  type: "Convolution"
  bottom: "block1/concat_d_1"
  top: "fire2/squeeze1x1_d"
  convolution_param {
    num_output: 8
    kernel_size: 1
	engine:CUDNN	
	}
}
layer {
  name: "fire2/elu_squeeze1x1_d"
  type: "ELU"
  bottom: "fire2/squeeze1x1_d"
  top: "fire2/squeeze1x1_d"
}
layer {
  name: "fire2/expand1x1_rgb"
  type: "Convolution"
  bottom: "fire2/squeeze1x1_rgb"
  top: "fire2/expand1x1_rgb"
  convolution_param {
    num_output: 24
    kernel_size: 1
	engine:CUDNN
	}
}
layer {
  name: "fire2/elu_expand1x1_rgb"
  type: "ELU"
  bottom: "fire2/expand1x1_rgb"
  top: "fire2/expand1x1_rgb"
}
layer {
  name: "fire2/expand1x1_d"
  type: "Convolution"
  bottom: "fire2/squeeze1x1_d"
  top: "fire2/expand1x1_d"
  convolution_param {
    num_output: 24
    kernel_size: 1
	engine:CUDNN
	}
}
layer {
  name: "fire2/elu_expand1x1_d"
  type: "ELU"
  bottom: "fire2/expand1x1_d"
  top: "fire2/expand1x1_d"
}
layer {
  name: "fire2/eltwise_expand1x1_rgbd"
  type: "Eltwise"
  bottom: "fire2/expand1x1_rgb"
  bottom: "fire2/expand1x1_d"
  top: "fire2/eltwise_expand1x1_rgbd"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fire2/expand3x3_rgb_1"
  type: "Convolution"
  bottom: "fire2/squeeze1x1_rgb"
  top: "fire2/expand3x3_rgb_1"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire2/elu_expand3x3_rgb_1"
  type: "ELU"
  bottom: "fire2/expand3x3_rgb_1"
  top: "fire2/expand3x3_rgb_1"
}
layer {
  name: "fire2/expand3x3_rgb_2"
  type: "Convolution"
  bottom: "fire2/expand3x3_rgb_1"
  top: "fire2/expand3x3_rgb_2"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire2/elu_expand3x3_rgb_2"
  type: "ELU"
  bottom: "fire2/expand3x3_rgb_2"
  top: "fire2/expand3x3_rgb_2"
}
layer {
  name: "fire2/mid_squeeze_expand3x3_rgb_2"
  type: "Convolution"
  bottom: "fire2/expand3x3_rgb_2"
  top: "fire2/mid_squeeze_expand3x3_rgb_2"
  convolution_param {
    num_output: 24
    kernel_size: 1
	engine:CUDNN
  }
}
layer {
  name: "fire2/elu_mid_squeeze_expand3x3_rgb_2"
  type: "ELU"
  bottom: "fire2/mid_squeeze_expand3x3_rgb_2"
  top: "fire2/mid_squeeze_expand3x3_rgb_2"
}
layer {
  name: "fire2/expand3x3_rgb_3"
  type: "Convolution"
  bottom: "fire2/mid_squeeze_expand3x3_rgb_2"
  top: "fire2/expand3x3_rgb_3"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire2/elu_expand3x3_rgb_3"
  type: "ELU"
  bottom: "fire2/expand3x3_rgb_3"
  top: "fire2/expand3x3_rgb_3"
}
layer {
  name: "fire2/expand3x3_rgb"
  type: "Convolution"
  bottom: "fire2/expand3x3_rgb_3"
  top: "fire2/expand3x3_rgb"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire2/elu_expand3x3_rgb"
  type: "ELU"
  bottom: "fire2/expand3x3_rgb"
  top: "fire2/expand3x3_rgb"
}
layer {
  name: "fire2/expand3x3_d_1"
  type: "Convolution"
  bottom: "fire2/squeeze1x1_d"
  top: "fire2/expand3x3_d_1"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire2/elu_expand3x3_d_1"
  type: "ELU"
  bottom: "fire2/expand3x3_d_1"
  top: "fire2/expand3x3_d_1"
}
layer {
  name: "fire2/expand3x3_d_2"
  type: "Convolution"
  bottom: "fire2/expand3x3_d_1"
  top: "fire2/expand3x3_d_2"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire2/elu_expand3x3_d_2"
  type: "ELU"
  bottom: "fire2/expand3x3_d_2"
  top: "fire2/expand3x3_d_2"
}
layer {
  name: "fire2/mid_squeeze_expand3x3_d_2"
  type: "Convolution"
  bottom: "fire2/expand3x3_d_2"
  top: "fire2/mid_squeeze_expand3x3_d_2"
  convolution_param {
    num_output: 24
    kernel_size: 1
	engine:CUDNN
  }
}
layer {
  name: "fire2/elu_mid_squeeze_expand3x3_d_2"
  type: "ELU"
  bottom: "fire2/mid_squeeze_expand3x3_d_2"
  top: "fire2/mid_squeeze_expand3x3_d_2"
}
layer {
  name: "fire2/expand3x3_d_3"
  type: "Convolution"
  bottom: "fire2/mid_squeeze_expand3x3_d_2"
  top: "fire2/expand3x3_d_3"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire2/elu_expand3x3_d_3"
  type: "ELU"
  bottom: "fire2/expand3x3_d_3"
  top: "fire2/expand3x3_d_3"
}
layer {
  name: "fire2/expand3x3_d"
  type: "Convolution"
  bottom: "fire2/expand3x3_d_3"
  top: "fire2/expand3x3_d"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire2/elu_expand3x3_d"
  type: "ELU"
  bottom: "fire2/expand3x3_d"
  top: "fire2/expand3x3_d"
}
layer {
  name: "fire2/eltwise_expand3x3_rgbd"
  type: "Eltwise"
  bottom: "fire2/expand3x3_rgb"
  bottom: "fire2/expand3x3_d"
  top: "fire2/eltwise_expand3x3_rgbd"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fire2/concat_rgbd"
  type: "Concat"
  bottom: "fire2/eltwise_expand1x1_rgbd"
  bottom: "fire2/eltwise_expand3x3_rgbd"
  top: "fire2/concat_rgbd"
}
layer {
  name: "fire2/concat_d"
  type: "Concat"
  bottom: "fire2/expand1x1_d"
  bottom: "fire2/expand3x3_d"
  top: "fire2/concat_d"
}
##### end of block 2

##### pooling 2
layer {
  name: "pool_rgbd_2"
  type: "Pooling"
  bottom: "fire2/concat_rgbd"
  top: "pool_rgbd_2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool_d_2"
  type: "Pooling"
  bottom: "fire2/concat_d"
  top: "pool_d_2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
###### 

##### block 3
layer {
  name: "fire3/squeeze1x1_rgb"
  type: "Convolution"
  bottom: "pool_rgbd_2"
  top: "fire3/squeeze1x1_rgb"
  convolution_param {
    num_output: 16
    kernel_size: 1
	engine:CUDNN
  }
}
layer {
  name: "fire3/elu_squeeze1x1_rgb"
  type: "ELU"
  bottom: "fire3/squeeze1x1_rgb"
  top: "fire3/squeeze1x1_rgb"
}
layer {
  name: "fire3/squeeze1x1_d"
  type: "Convolution"
  bottom: "pool_d_2"
  top: "fire3/squeeze1x1_d"
  convolution_param {
    num_output: 16
    kernel_size: 1
	engine:CUDNN	
	}
}
layer {
  name: "fire3/elu_squeeze1x1_d"
  type: "ELU"
  bottom: "fire3/squeeze1x1_d"
  top: "fire3/squeeze1x1_d"
}
layer {
  name: "fire3/expand1x1_rgb"
  type: "Convolution"
  bottom: "fire3/squeeze1x1_rgb"
  top: "fire3/expand1x1_rgb"
  convolution_param {
    num_output: 48
    kernel_size: 1
	engine:CUDNN
	}
}
layer {
  name: "fire3/elu_expand1x1_rgb"
  type: "ELU"
  bottom: "fire3/expand1x1_rgb"
  top: "fire3/expand1x1_rgb"
}
layer {
  name: "fire3/expand1x1_d"
  type: "Convolution"
  bottom: "fire3/squeeze1x1_d"
  top: "fire3/expand1x1_d"
  convolution_param {
    num_output: 48
    kernel_size: 1
	engine:CUDNN
	}
}
layer {
  name: "fire3/elu_expand1x1_d"
  type: "ELU"
  bottom: "fire3/expand1x1_d"
  top: "fire3/expand1x1_d"
}
layer {
  name: "fire3/eltwise_expand1x1_rgbd"
  type: "Eltwise"
  bottom: "fire3/expand1x1_rgb"
  bottom: "fire3/expand1x1_d"
  top: "fire3/eltwise_expand1x1_rgbd"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fire3/expand3x3_rgb_1"
  type: "Convolution"
  bottom: "fire3/squeeze1x1_rgb"
  top: "fire3/expand3x3_rgb_1"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire3/elu_expand3x3_rgb_1"
  type: "ELU"
  bottom: "fire3/expand3x3_rgb_1"
  top: "fire3/expand3x3_rgb_1"
}
layer {
  name: "fire3/expand3x3_rgb_2"
  type: "Convolution"
  bottom: "fire3/expand3x3_rgb_1"
  top: "fire3/expand3x3_rgb_2"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire3/elu_expand3x3_rgb_2"
  type: "ELU"
  bottom: "fire3/expand3x3_rgb_2"
  top: "fire3/expand3x3_rgb_2"
}
layer {
  name: "fire3/mid_squeeze_expand3x3_rgb_2"
  type: "Convolution"
  bottom: "fire3/expand3x3_rgb_2"
  top: "fire3/mid_squeeze_expand3x3_rgb_2"
  convolution_param {
    num_output: 48
    kernel_size: 1
	engine:CUDNN
  }
}
layer {
  name: "fire3/elu_mid_squeeze_expand3x3_rgb_2"
  type: "ELU"
  bottom: "fire3/mid_squeeze_expand3x3_rgb_2"
  top: "fire3/mid_squeeze_expand3x3_rgb_2"
}
layer {
  name: "fire3/expand3x3_rgb_3"
  type: "Convolution"
  bottom: "fire3/mid_squeeze_expand3x3_rgb_2"
  top: "fire3/expand3x3_rgb_3"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire3/elu_expand3x3_rgb_3"
  type: "ELU"
  bottom: "fire3/expand3x3_rgb_3"
  top: "fire3/expand3x3_rgb_3"
}
layer {
  name: "fire3/expand3x3_rgb"
  type: "Convolution"
  bottom: "fire3/expand3x3_rgb_3"
  top: "fire3/expand3x3_rgb"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire3/elu_expand3x3_rgb"
  type: "ELU"
  bottom: "fire3/expand3x3_rgb"
  top: "fire3/expand3x3_rgb"
}
layer {
  name: "fire3/expand3x3_d_1"
  type: "Convolution"
  bottom: "fire3/squeeze1x1_d"
  top: "fire3/expand3x3_d_1"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire3/elu_expand3x3_d_1"
  type: "ELU"
  bottom: "fire3/expand3x3_d_1"
  top: "fire3/expand3x3_d_1"
}
layer {
  name: "fire3/expand3x3_d_2"
  type: "Convolution"
  bottom: "fire3/expand3x3_d_1"
  top: "fire3/expand3x3_d_2"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire3/elu_expand3x3_d_2"
  type: "ELU"
  bottom: "fire3/expand3x3_d_2"
  top: "fire3/expand3x3_d_2"
}
layer {
  name: "fire3/mid_squeeze_expand3x3_d_2"
  type: "Convolution"
  bottom: "fire3/expand3x3_d_2"
  top: "fire3/mid_squeeze_expand3x3_d_2"
  convolution_param {
    num_output: 48
    kernel_size: 1
	engine:CUDNN
  }
}
layer {
  name: "fire3/elu_mid_squeeze_expand3x3_d_2"
  type: "ELU"
  bottom: "fire3/mid_squeeze_expand3x3_d_2"
  top: "fire3/mid_squeeze_expand3x3_d_2"
}
layer {
  name: "fire3/expand3x3_d_3"
  type: "Convolution"
  bottom: "fire3/mid_squeeze_expand3x3_d_2"
  top: "fire3/expand3x3_d_3"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire3/elu_expand3x3_d_3"
  type: "ELU"
  bottom: "fire3/expand3x3_d_3"
  top: "fire3/expand3x3_d_3"
}
layer {
  name: "fire3/expand3x3_d"
  type: "Convolution"
  bottom: "fire3/expand3x3_d_3"
  top: "fire3/expand3x3_d"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire3/elu_expand3x3_d"
  type: "ELU"
  bottom: "fire3/expand3x3_d"
  top: "fire3/expand3x3_d"
}
layer {
  name: "fire3/eltwise_expand3x3_rgbd"
  type: "Eltwise"
  bottom: "fire3/expand3x3_rgb"
  bottom: "fire3/expand3x3_d"
  top: "fire3/eltwise_expand3x3_rgbd"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fire3/concat_rgbd"
  type: "Concat"
  bottom: "fire3/eltwise_expand1x1_rgbd"
  bottom: "fire3/eltwise_expand3x3_rgbd"
  top: "fire3/concat_rgbd"
}
layer {
  name: "fire3/concat_d"
  type: "Concat"
  bottom: "fire3/expand1x1_d"
  bottom: "fire3/expand3x3_d"
  top: "fire3/concat_d"
}
##### end of block 3

##### score
layer {
  name: "score_block3_rgbd"
  type: "Convolution"
  bottom: "fire3/concat_rgbd"
  top: "score_block3_rgbd"
  convolution_param {
    num_output: 7
    pad: 0
    kernel_size: 1
	engine:CUDNN
  }
}
layer {
  name: "score_block3_d"
  type: "Convolution"
  bottom: "fire3/concat_d"
  top: "score_block3_d"
   convolution_param {
    num_output: 7
    pad: 0
    kernel_size: 1
	engine:CUDNN
  }
}
##### end of score block 

##### spat dropout
#layer {
#  name: "spat_drop3_rgbd"
#  type: "Python"
#  bottom: "score_block3_rgbd"
#  top: "score_block3_rgbd"
#  python_param {
#    module: "spatial_dropout"
#    layer: "SpatialDropoutLayer"
#	param_str: "{\'phase\': \'TRAIN\', \'p\': \'0.5\'}"
#  }
#}
### Top shape: 1 512 8 16 (65536)
#layer {
#  name: "spat_drop3_d"
#  type: "Python"
#  bottom: "score_block3_d"
#  top: "score_block3_d"
#  python_param {
#    module: "spatial_dropout"
#    layer: "SpatialDropoutLayer"
#	param_str: "{\'phase\': \'TRAIN\', \'p\': \'0.5\'}"
#  }
#}
layer {
  name: "spat_drop3_d"
  type: "Dropout"
  bottom: "score_block3_d"
  top: "score_block3_d"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "spat_drop3_rgbd"
  type: "Dropout"
  bottom: "score_block3_rgbd"
  top: "score_block3_rgbd"
  dropout_param {
    dropout_ratio: 0.5
  }
}
##### end of spat dropout

##### block deconvolutional
layer {
  name: "upscore_3_rgbd"
  type: "Deconvolution"
  bottom: "score_block3_rgbd"
  top: "upscore_3_rgbd"
  param {
    lr_mult: 0
	decay_mult: 0
  }
  convolution_param {
    num_output: 7
    bias_term: false
	kernel_size: 8
    stride: 4
	pad: 2
	group: 7
	weight_filler {
      type: "bilinear"
		}
  }
}
layer {
  name: "upscore_3_d"
  type: "Deconvolution"
  bottom: "score_block3_d"
  top: "upscore_3_d"
  param {
    lr_mult: 0
	decay_mult: 0
  }
  convolution_param {
    num_output: 7
    bias_term: false
	kernel_size: 8
    stride: 4
	pad: 2
	group: 7
	weight_filler {
      type: "bilinear"
		}
  }
}
##### end of block deconvolutional

##### pooling 3
layer {
  name: "pool_rgbd_3"
  type: "Pooling"
  bottom: "upscore_3_rgbd"
  top: "pool_rgbd_3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool_d_3"
  type: "Pooling"
  bottom: "upscore_3_d"
  top: "pool_d_3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
###### 

###### block 4
layer {
  name: "fire4/squeeze1x1_rgb"
  type: "Convolution"
  bottom: "pool_rgbd_3"
  top: "fire4/squeeze1x1_rgb"
  convolution_param {
    num_output: 8
    kernel_size: 1
	engine:CUDNN
  }
}
layer {
  name: "fire4/elu_squeeze1x1_rgb"
  type: "ELU"
  bottom: "fire4/squeeze1x1_rgb"
  top: "fire4/squeeze1x1_rgb"
}
layer {
  name: "fire4/squeeze1x1_d"
  type: "Convolution"
  bottom: "pool_d_3"
  top: "fire4/squeeze1x1_d"
  convolution_param {
    num_output: 8
    kernel_size: 1
	engine:CUDNN	
	}
}
layer {
  name: "fire4/elu_squeeze1x1_d"
  type: "ELU"
  bottom: "fire4/squeeze1x1_d"
  top: "fire4/squeeze1x1_d"
}
layer {
  name: "fire4/expand1x1_rgb"
  type: "Convolution"
  bottom: "fire4/squeeze1x1_rgb"
  top: "fire4/expand1x1_rgb"
  convolution_param {
    num_output: 24
    kernel_size: 1
	engine:CUDNN
	}
}
layer {
  name: "fire4/elu_expand1x1_rgb"
  type: "ELU"
  bottom: "fire4/expand1x1_rgb"
  top: "fire4/expand1x1_rgb"
}
layer {
  name: "fire4/expand1x1_d"
  type: "Convolution"
  bottom: "fire4/squeeze1x1_d"
  top: "fire4/expand1x1_d"
  convolution_param {
    num_output: 24
    kernel_size: 1
	engine:CUDNN
	}
}
layer {
  name: "fire4/elu_expand1x1_d"
  type: "ELU"
  bottom: "fire4/expand1x1_d"
  top: "fire4/expand1x1_d"
}
layer {
  name: "fire4/eltwise_expand1x1_rgbd"
  type: "Eltwise"
  bottom: "fire4/expand1x1_rgb"
  bottom: "fire4/expand1x1_d"
  top: "fire4/eltwise_expand1x1_rgbd"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fire4/expand3x3_rgb_1"
  type: "Convolution"
  bottom: "fire4/squeeze1x1_rgb"
  top: "fire4/expand3x3_rgb_1"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire4/elu_expand3x3_rgb_1"
  type: "ELU"
  bottom: "fire4/expand3x3_rgb_1"
  top: "fire4/expand3x3_rgb_1"
}
layer {
  name: "fire4/expand3x3_rgb_2"
  type: "Convolution"
  bottom: "fire4/expand3x3_rgb_1"
  top: "fire4/expand3x3_rgb_2"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire4/elu_expand3x3_rgb_2"
  type: "ELU"
  bottom: "fire4/expand3x3_rgb_2"
  top: "fire4/expand3x3_rgb_2"
}
layer {
  name: "fire4/mid_squeeze_expand3x3_rgb_2"
  type: "Convolution"
  bottom: "fire4/expand3x3_rgb_2"
  top: "fire4/mid_squeeze_expand3x3_rgb_2"
  convolution_param {
    num_output: 24
    kernel_size: 1
	engine:CUDNN
  }
}
layer {
  name: "fire4/elu_mid_squeeze_expand3x3_rgb_2"
  type: "ELU"
  bottom: "fire4/mid_squeeze_expand3x3_rgb_2"
  top: "fire4/mid_squeeze_expand3x3_rgb_2"
}
layer {
  name: "fire4/expand3x3_rgb_3"
  type: "Convolution"
  bottom: "fire4/mid_squeeze_expand3x3_rgb_2"
  top: "fire4/expand3x3_rgb_3"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire4/elu_expand3x3_rgb_3"
  type: "ELU"
  bottom: "fire4/expand3x3_rgb_3"
  top: "fire4/expand3x3_rgb_3"
}
layer {
  name: "fire4/expand3x3_rgb"
  type: "Convolution"
  bottom: "fire4/expand3x3_rgb_3"
  top: "fire4/expand3x3_rgb"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire4/elu_expand3x3_rgb"
  type: "ELU"
  bottom: "fire4/expand3x3_rgb"
  top: "fire4/expand3x3_rgb"
}
layer {
  name: "fire4/expand3x3_d_1"
  type: "Convolution"
  bottom: "fire4/squeeze1x1_d"
  top: "fire4/expand3x3_d_1"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire4/elu_expand3x3_d_1"
  type: "ELU"
  bottom: "fire4/expand3x3_d_1"
  top: "fire4/expand3x3_d_1"
}
layer {
  name: "fire4/expand3x3_d_2"
  type: "Convolution"
  bottom: "fire4/expand3x3_d_1"
  top: "fire4/expand3x3_d_2"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire4/elu_expand3x3_d_2"
  type: "ELU"
  bottom: "fire4/expand3x3_d_2"
  top: "fire4/expand3x3_d_2"
}
layer {
  name: "fire4/mid_squeeze_expand3x3_d_2"
  type: "Convolution"
  bottom: "fire4/expand3x3_d_2"
  top: "fire4/mid_squeeze_expand3x3_d_2"
  convolution_param {
    num_output: 24
    kernel_size: 1
	engine:CUDNN
  }
}
layer {
  name: "fire4/elu_mid_squeeze_expand3x3_d_2"
  type: "ELU"
  bottom: "fire4/mid_squeeze_expand3x3_d_2"
  top: "fire4/mid_squeeze_expand3x3_d_2"
}
layer {
  name: "fire4/expand3x3_d_3"
  type: "Convolution"
  bottom: "fire4/mid_squeeze_expand3x3_d_2"
  top: "fire4/expand3x3_d_3"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire4/elu_expand3x3_d_3"
  type: "ELU"
  bottom: "fire4/expand3x3_d_3"
  top: "fire4/expand3x3_d_3"
}
layer {
  name: "fire4/expand3x3_d"
  type: "Convolution"
  bottom: "fire4/expand3x3_d_3"
  top: "fire4/expand3x3_d"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire4/elu_expand3x3_d"
  type: "ELU"
  bottom: "fire4/expand3x3_d"
  top: "fire4/expand3x3_d"
}
layer {
  name: "fire4/eltwise_expand3x3_rgbd"
  type: "Eltwise"
  bottom: "fire4/expand3x3_rgb"
  bottom: "fire4/expand3x3_d"
  top: "fire4/eltwise_expand3x3_rgbd"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fire4/concat_rgbd"
  type: "Concat"
  bottom: "fire4/eltwise_expand1x1_rgbd"
  bottom: "fire4/eltwise_expand3x3_rgbd"
  top: "fire4/concat_rgbd"
}
layer {
  name: "fire4/concat_d"
  type: "Concat"
  bottom: "fire4/expand1x1_d"
  bottom: "fire4/expand3x3_d"
  top: "fire4/concat_d"
}
##### end of block 4

##### pooling 4
layer {
  name: "pool_rgbd_4"
  type: "Pooling"
  bottom: "fire4/concat_rgbd"
  top: "pool_rgbd_4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool_d_4"
  type: "Pooling"
  bottom: "fire4/concat_d"
  top: "pool_d_4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
###### 

##### block 5
layer {
  name: "fire5/squeeze1x1_rgb"
  type: "Convolution"
  bottom: "pool_rgbd_4"
  top: "fire5/squeeze1x1_rgb"
  convolution_param {
    num_output: 16
    kernel_size: 1
	engine:CUDNN
  }
}
layer {
  name: "fire5/elu_squeeze1x1_rgb"
  type: "ELU"
  bottom: "fire5/squeeze1x1_rgb"
  top: "fire5/squeeze1x1_rgb"
}
layer {
  name: "fire5/squeeze1x1_d"
  type: "Convolution"
  bottom: "pool_d_4"
  top: "fire5/squeeze1x1_d"
  convolution_param {
    num_output: 16
    kernel_size: 1
	engine:CUDNN	
	}
}
layer {
  name: "fire5/elu_squeeze1x1_d"
  type: "ELU"
  bottom: "fire5/squeeze1x1_d"
  top: "fire5/squeeze1x1_d"
}
layer {
  name: "fire5/expand1x1_rgb"
  type: "Convolution"
  bottom: "fire5/squeeze1x1_rgb"
  top: "fire5/expand1x1_rgb"
  convolution_param {
    num_output: 48
    kernel_size: 1
	engine:CUDNN
	}
}
layer {
  name: "fire5/elu_expand1x1_rgb"
  type: "ELU"
  bottom: "fire5/expand1x1_rgb"
  top: "fire5/expand1x1_rgb"
}
layer {
  name: "fire5/expand1x1_d"
  type: "Convolution"
  bottom: "fire5/squeeze1x1_d"
  top: "fire5/expand1x1_d"
  convolution_param {
    num_output: 48
    kernel_size: 1
	engine:CUDNN
	}
}
layer {
  name: "fire5/elu_expand1x1_d"
  type: "ELU"
  bottom: "fire5/expand1x1_d"
  top: "fire5/expand1x1_d"
}
layer {
  name: "fire5/eltwise_expand1x1_rgbd"
  type: "Eltwise"
  bottom: "fire5/expand1x1_rgb"
  bottom: "fire5/expand1x1_d"
  top: "fire5/eltwise_expand1x1_rgbd"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fire5/expand3x3_rgb_1"
  type: "Convolution"
  bottom: "fire5/squeeze1x1_rgb"
  top: "fire5/expand3x3_rgb_1"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire5/elu_expand3x3_rgb_1"
  type: "ELU"
  bottom: "fire5/expand3x3_rgb_1"
  top: "fire5/expand3x3_rgb_1"
}
layer {
  name: "fire5/expand3x3_rgb_2"
  type: "Convolution"
  bottom: "fire5/expand3x3_rgb_1"
  top: "fire5/expand3x3_rgb_2"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire5/elu_expand3x3_rgb_2"
  type: "ELU"
  bottom: "fire5/expand3x3_rgb_2"
  top: "fire5/expand3x3_rgb_2"
}
layer {
  name: "fire5/mid_squeeze_expand3x3_rgb_2"
  type: "Convolution"
  bottom: "fire5/expand3x3_rgb_2"
  top: "fire5/mid_squeeze_expand3x3_rgb_2"
  convolution_param {
    num_output: 48
    kernel_size: 1
	engine:CUDNN
  }
}
layer {
  name: "fire5/elu_mid_squeeze_expand3x3_rgb_2"
  type: "ELU"
  bottom: "fire5/mid_squeeze_expand3x3_rgb_2"
  top: "fire5/mid_squeeze_expand3x3_rgb_2"
}
layer {
  name: "fire5/expand3x3_rgb_3"
  type: "Convolution"
  bottom: "fire5/mid_squeeze_expand3x3_rgb_2"
  top: "fire5/expand3x3_rgb_3"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire5/elu_expand3x3_rgb_3"
  type: "ELU"
  bottom: "fire5/expand3x3_rgb_3"
  top: "fire5/expand3x3_rgb_3"
}
layer {
  name: "fire5/expand3x3_rgb"
  type: "Convolution"
  bottom: "fire5/expand3x3_rgb_3"
  top: "fire5/expand3x3_rgb"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire5/elu_expand3x3_rgb"
  type: "ELU"
  bottom: "fire5/expand3x3_rgb"
  top: "fire5/expand3x3_rgb"
}
layer {
  name: "fire5/expand3x3_d_1"
  type: "Convolution"
  bottom: "fire5/squeeze1x1_d"
  top: "fire5/expand3x3_d_1"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire5/elu_expand3x3_d_1"
  type: "ELU"
  bottom: "fire5/expand3x3_d_1"
  top: "fire5/expand3x3_d_1"
}
layer {
  name: "fire5/expand3x3_d_2"
  type: "Convolution"
  bottom: "fire5/expand3x3_d_1"
  top: "fire5/expand3x3_d_2"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire5/elu_expand3x3_d_2"
  type: "ELU"
  bottom: "fire5/expand3x3_d_2"
  top: "fire5/expand3x3_d_2"
}
layer {
  name: "fire5/mid_squeeze_expand3x3_d_2"
  type: "Convolution"
  bottom: "fire5/expand3x3_d_2"
  top: "fire5/mid_squeeze_expand3x3_d_2"
  convolution_param {
    num_output: 48
    kernel_size: 1
	engine:CUDNN
  }
}
layer {
  name: "fire5/elu_mid_squeeze_expand3x3_d_2"
  type: "ELU"
  bottom: "fire5/mid_squeeze_expand3x3_d_2"
  top: "fire5/mid_squeeze_expand3x3_d_2"
}
layer {
  name: "fire5/expand3x3_d_3"
  type: "Convolution"
  bottom: "fire5/mid_squeeze_expand3x3_d_2"
  top: "fire5/expand3x3_d_3"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire5/elu_expand3x3_d_3"
  type: "ELU"
  bottom: "fire5/expand3x3_d_3"
  top: "fire5/expand3x3_d_3"
}
layer {
  name: "fire5/expand3x3_d"
  type: "Convolution"
  bottom: "fire5/expand3x3_d_3"
  top: "fire5/expand3x3_d"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
	engine:CUDNN
	}
}
layer {
  name: "fire5/elu_expand3x3_d"
  type: "ELU"
  bottom: "fire5/expand3x3_d"
  top: "fire5/expand3x3_d"
}
layer {
  name: "fire5/eltwise_expand3x3_rgbd"
  type: "Eltwise"
  bottom: "fire5/expand3x3_rgb"
  bottom: "fire5/expand3x3_d"
  top: "fire5/eltwise_expand3x3_rgbd"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fire5/concat_rgbd"
  type: "Concat"
  bottom: "fire5/eltwise_expand1x1_rgbd"
  bottom: "fire5/eltwise_expand3x3_rgbd"
  top: "fire5/concat_rgbd"
}
layer {
  name: "fire5/concat_d"
  type: "Concat"
  bottom: "fire5/expand1x1_d"
  bottom: "fire5/expand3x3_d"
  top: "fire5/concat_d"
}
##### end of block 5

##### score
layer {
  name: "score_block5_rgbd"
  type: "Convolution"
  bottom: "fire5/concat_rgbd"
  top: "score_block5_rgbd"
  convolution_param {
    num_output: 7
    pad: 0
    kernel_size: 1
	engine:CUDNN
  }
}
layer {
  name: "score_block5_d"
  type: "Convolution"
  bottom: "fire5/concat_d"
  top: "score_block5_d"
  convolution_param {
    num_output: 7
    pad: 0
    kernel_size: 1
	engine:CUDNN
  }
}
##### end of score block 

##### spat dropout
#layer {
#  name: "spat_drop3_rgbd"
#  type: "Python"
#  bottom: "score_block3_rgbd"
#  top: "score_block3_rgbd"
#  python_param {
#    module: "spatial_dropout"
#    layer: "SpatialDropoutLayer"
#	param_str: "{\'phase\': \'TRAIN\', \'p\': \'0.5\'}"
#  }
#}
### Top shape: 1 512 8 16 (65536)
#layer {
#  name: "spat_drop3_d"
#  type: "Python"
#  bottom: "score_block3_d"
#  top: "score_block3_d"
#  python_param {
#    module: "spatial_dropout"
#    layer: "SpatialDropoutLayer"
#	param_str: "{\'phase\': \'TRAIN\', \'p\': \'0.5\'}"
#  }
#}
layer {
  name: "spat_drop5_d"
  type: "Dropout"
  bottom: "score_block5_d"
  top: "score_block5_d"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "spat_drop5_rgbd"
  type: "Dropout"
  bottom: "score_block5_rgbd"
  top: "score_block5_rgbd"
  dropout_param {
    dropout_ratio: 0.5
  }
}
##### end of spat dropout

##### block deconvolutional
layer {
  name: "upscore_5_rgbd"
  type: "Deconvolution"
  bottom: "score_block5_rgbd"
  top: "upscore_5_rgbd"
  param {
    lr_mult: 0
	decay_mult: 0
  }
  convolution_param {
    num_output: 7
    bias_term: false
	kernel_size: 8
    stride: 4
	pad: 2
	group: 7
	weight_filler {
      type: "bilinear"
		}
  }
}
layer {
  name: "upscore_5_d"
  type: "Deconvolution"
  bottom: "score_block5_d"
  top: "upscore_5_d"
  param {
    lr_mult: 0
	decay_mult: 0
  }
  convolution_param {
    num_output: 7
    bias_term: false
	kernel_size: 8
    stride: 4
	pad: 2
	group: 7
	weight_filler {
      type: "bilinear"
		}
  }
}
### sum layer
layer {
  name: "sum_score"
  type: "Eltwise"
  bottom: "upscore_5_rgbd"
  bottom: "upscore_5_d"
  top: "score"
  eltwise_param {
    operation: SUM
  }
}
##### end of deconvolutional

##### loss layer
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "score"
  bottom: "label"
  top: "loss"
  loss_param {
    ignore_label: 255
    normalize: false
  }
}
##### end of loss layer
